# 재무제표 기업코드 대신 사업자등록번호 칼럼으로 넣기

## 손익계산서

In [1]:
import pandas as pd

In [51]:
import re

In [31]:
icm_stmt = pd.read_excel('/Users/linakim/Desktop/최종프로젝트/데이터_가공/손익계산서/손익계산서_v3.xlsx',
                        dtype={'기업코드':str, '회차' : str, '등록일' : str, '수익(매출액)':float, 
                               '영업이익(손실)':float, '당기순이익(손실)':float},
                        index=False)

In [32]:
icm_stmt.head()

,Unnamed: 0,Unnamed: 0.1,기업코드,회차,등록일,수익(매출액),영업이익(손실),당기순이익(손실)
0,0,0,00956028,제 16 기,20180420,24347218.0,1.203810e+05,-1.629679e+06
1,1,1,01165739,제 3 기,20180430,NaN,-3.982045e+06,-1.386465e+07
2,2,2,00171636,제 53 기,20180402,NaN,1.495268e+10,-1.436855e+11
3,3,3,00147772,제 49 기,20180330,NaN,NaN,NaN
4,4,4,00273110,제 29 기,20180402,NaN,-8.455347e+09,-1.079760e+10

In [25]:
corp = pd.read_excel('/Users/linakim/Desktop/최종프로젝트/데이터_가공/기업개황/기업개황_v3.xlsx',
                    dtype={'corp_code':str, 'bizr_no':str})

In [28]:
corp.head()

,Unnamed: 0,corp_code,corp_name,corp_name_eng,jurir_no,bizr_no,adres,hm_url,country_code,phn_no,country_code_fax,fax_no,induty_code,est_dt,acc_mt
0,0,00434003,(주)다코,Daco corporation,1615110021778,3128134722,충청남도 천안시 청당동 419-12,NaN,82,0415651800,82,0415636808,25931,19970611.0,12.0
1,1,00434456,일산약품(주),"ILSAN PHARMACEUTICAL CO.,LTD.",1412110004641,2248105027,강원도 원주시 원동 303,NaN,82,0337637535,82,0337636433,21101,19910615.0,12.0
2,2,00430964,굿앤엘에스주식회사,"Good & LS Co.,Ltd.",1101112672875,1048177488,서울특별시 중구 태평로2가 120,NaN,82,0262638185,82,NaN,64999,20021213.0,11.0
3,3,00432403,한라판지(주),"HANLA PARKING CO.,LTD",2201110019993,6168120149,제주특별자치도 북제주군 한림읍 상명리 587,NaN,82,0647968001,82,0647968003,17123,19970601.0,12.0
4,4,00388953,크레디피아제이십오차유동화전문회사,Credipia 25th Asset Securitization Specialty L...,1101140036118,1078608501,서울특별시 영등포구 여의도동 36-3,NaN,82,077687911,82,7849869,64999,20011121.0,10.0

In [33]:
icm_stmt = icm_stmt.rename(columns={"기업코드" : "corp_code"})

In [34]:
icm_stmt.head()

,Unnamed: 0,Unnamed: 0.1,corp_code,회차,등록일,수익(매출액),영업이익(손실),당기순이익(손실)
0,0,0,00956028,제 16 기,20180420,24347218.0,1.203810e+05,-1.629679e+06
1,1,1,01165739,제 3 기,20180430,NaN,-3.982045e+06,-1.386465e+07
2,2,2,00171636,제 53 기,20180402,NaN,1.495268e+10,-1.436855e+11
3,3,3,00147772,제 49 기,20180330,NaN,NaN,NaN
4,4,4,00273110,제 29 기,20180402,NaN,-8.455347e+09,-1.079760e+10

In [35]:
 df = pd.merge(icm_stmt, corp, on='corp_code')

In [36]:
len(icm_stmt)

5925

In [37]:
df.head()

,Unnamed: 0_x,Unnamed: 0.1,corp_code,회차,등록일,수익(매출액),영업이익(손실),당기순이익(손실),Unnamed: 0_y,corp_name,...,bizr_no,adres,hm_url,country_code,phn_no,country_code_fax,fax_no,induty_code,est_dt,acc_mt
0,0,0,00956028,제 16 기,20180420,24347218.0,120381.0,-1629679.0,14842,엑세스바이오 인코퍼레이션,...,0100888833,"65 Clyde Road Suite A Somerset NJ 08873, USA",accessbio.net,1,17328734040,82,7328734043,21300,20020927.0,12.0
1,1886,1886,00956028,제 17 기,20190430,34158734.0,870002.0,735372.0,14842,엑세스바이오 인코퍼레이션,...,0100888833,"65 Clyde Road Suite A Somerset NJ 08873, USA",accessbio.net,1,17328734040,82,7328734043,21300,20020927.0,12.0
2,3864,3864,00956028,제 18 기,20200424,32067422.0,-2688741.0,-6263868.0,14842,엑세스바이오 인코퍼레이션,...,0100888833,"65 Clyde Road Suite A Somerset NJ 08873, USA",accessbio.net,1,17328734040,82,7328734043,21300,20020927.0,12.0
3,1,1,01165739,제 3 기,20180430,NaN,-3982045.0,-13864646.0,37539,잉글우드랩 주식회사,...,0101038103,"88 W. Sheffield Avenue, Englewood, NJ 07631, USA",englewoodlab.com,1,12015672267,82,2015672280,204,20150820.0,12.0
4,1887,1887,01165739,제 4 기,20190329,NaN,3641676.0,-3714588.0,37539,잉글우드랩 주식회사,...,0101038103,"88 W. Sheffield Avenue, Englewood, NJ 07631, USA",englewoodlab.com,1,12015672267,82,2015672280,204,20150820.0,12.0

In [39]:
df = df.drop(['Unnamed: 0_x', 'Unnamed: 0.1', 'Unnamed: 0_y', 'corp_name', 'adres', 'hm_url', 'country_code', 'phn_no', 'fax_no', 'country_code_fax', 'induty_code', 'est_dt', 'acc_mt'], axis=1)

In [40]:
df.head()

,corp_code,회차,등록일,수익(매출액),영업이익(손실),당기순이익(손실),corp_name_eng,jurir_no,bizr_no
0,00956028,제 16 기,20180420,24347218.0,120381.0,-1629679.0,"Access Bio, Inc.",NaN,0100888833
1,00956028,제 17 기,20190430,34158734.0,870002.0,735372.0,"Access Bio, Inc.",NaN,0100888833
2,00956028,제 18 기,20200424,32067422.0,-2688741.0,-6263868.0,"Access Bio, Inc.",NaN,0100888833
3,01165739,제 3 기,20180430,NaN,-3982045.0,-13864646.0,"Englewood Lab, Inc.",NaN,0101038103
4,01165739,제 4 기,20190329,NaN,3641676.0,-3714588.0,"Englewood Lab, Inc.",NaN,0101038103

In [42]:
df = df.drop(['corp_name_eng', 'jurir_no'], axis=1)

In [45]:
df = df.drop(['corp_code'], axis=1)

In [46]:
df.head()

       회차       등록일     수익(매출액)   영업이익(손실)   당기순이익(손실)     bizr_no
0  제 16 기  20180420  24347218.0   120381.0  -1629679.0  0100888833
1  제 17 기  20190430  34158734.0   870002.0    735372.0  0100888833
2  제 18 기  20200424  32067422.0 -2688741.0  -6263868.0  0100888833
3   제 3 기  20180430         NaN -3982045.0 -13864646.0  0101038103
4   제 4 기  20190329         NaN  3641676.0  -3714588.0  0101038103

In [52]:
# 한글&공백 지우는 함수 
def remove_korean(data_list):
    for i in range(len(data_list)):
        data_list.iloc[i] = re.sub('[|가-힣]+', '', str(data_list.iloc[i]))
        data_list.iloc[i] = re.sub('[\s]', '', str(data_list.iloc[i]))

In [53]:
remove_korean(df['회차'])

/usr/local/lib/python3.7/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [54]:
df.head()

   회차       등록일     수익(매출액)   영업이익(손실)   당기순이익(손실)     bizr_no
0  16  20180420  24347218.0   120381.0  -1629679.0  0100888833
1  17  20190430  34158734.0   870002.0    735372.0  0100888833
2  18  20200424  32067422.0 -2688741.0  -6263868.0  0100888833
3   3  20180430         NaN -3982045.0 -13864646.0  0101038103
4   4  20190329         NaN  3641676.0  -3714588.0  0101038103

In [56]:
df.to_excel('손익계산서_v4.xlsx', encoding='euc-kr')

## 현금흐름표

In [57]:
cash_flow = pd.read_excel('/Users/linakim/Desktop/최종프로젝트/데이터_가공/현금흐름표/현금흐름표_v3.xlsx',
                         dtype={'기업코드':str, '회차' : str, '등록일' : str, '영업활동현금흐름':float, 
                               '투자활동현금흐름':float, '재무활동현금흐름':float},
                        index=False)

In [58]:
cash_flow.head()

,Unnamed: 0,Unnamed: 0.1,기업코드,회차,등록일,영업활동현금흐름,투자활동현금흐름,재무활동현금흐름
0,0,0,00956028,제 16 기,20180420,1.161698e+06,-1.578567e+07,8.305080e+05
1,1,1,01165739,제 3 기,20180430,-4.598219e+06,-1.301192e+07,5.795985e+06
2,2,2,00171636,제 53 기,20180402,9.117279e+09,1.722671e+10,-2.059409e+10
3,3,3,00147772,제 49 기,20180330,NaN,NaN,NaN
4,4,4,00273110,제 29 기,20180402,-7.277233e+09,-6.512408e+09,-1.119352e+07

In [61]:
cash_flow = cash_flow.rename(columns={"기업코드" : "corp_code"})
df2 = pd.merge(cash_flow, corp, on='corp_code')
df2 = df2.drop(['Unnamed: 0_x', 'Unnamed: 0.1', 'Unnamed: 0_y', 'corp_name', 'adres', 'hm_url', 
              'country_code', 'phn_no', 'fax_no', 'country_code_fax', 'induty_code', 'est_dt', 
              'acc_mt', 'corp_name_eng', 'jurir_no', 'corp_code'], axis=1)

In [63]:
remove_korean(df2['회차'])

/usr/local/lib/python3.7/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [64]:
df2.head()

   회차       등록일   영업활동현금흐름    투자활동현금흐름   재무활동현금흐름     bizr_no
0  16  20180420  1161698.0 -15785668.0   830508.0  0100888833
1  17  20190430  -493045.0  -8849543.0  5488735.0  0100888833
2  18  20200424  2396747.0    147906.0  -134921.0  0100888833
3   3  20180430 -4598219.0 -13011920.0  5795985.0  0101038103
4   4  20190329 -5175638.0  -7513805.0  7578926.0  0101038103

In [65]:
df2.to_excel('현금흐름표_v4.xlsx', encoding='euc-kr')

## 재무상태표

In [69]:
fin_status = pd.read_excel('/Users/linakim/Desktop/최종프로젝트/데이터_가공/재무상태표/재무상태표_v3.xlsx',
                         dtype={'기업코드':str, '회차' : str, '등록일' : str, '유동자산':float, 
                               '비유동자산':float, '자산총계':float, '유동부채':float, '비유동부채':float,
                               '부채총계':float, '자본금':float, '이익잉여금(결손금)':float, '자본총계':float},
                        index=False)

In [70]:
fin_status = fin_status.rename(columns={"기업코드" : "corp_code"})
df3 = pd.merge(fin_status, corp, on='corp_code')
df3 = df3.drop(['Unnamed: 0_x', 'Unnamed: 0.1', 'Unnamed: 0_y', 'corp_name', 'adres', 'hm_url', 
              'country_code', 'phn_no', 'fax_no', 'country_code_fax', 'induty_code', 'est_dt', 
              'acc_mt', 'corp_name_eng', 'jurir_no', 'corp_code'], axis=1)  
remove_korean(df3['회차'])

/usr/local/lib/python3.7/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [71]:
df3.head()

,회차,등록일,유동자산,비유동자산,자산총계,유동부채,비유동부채,부채총계,자본금,이익잉여금(결손금),자본총계,bizr_no
0,16,20180420,23053799.0,55270950.0,78324749.0,15314213.0,11512077.0,26826290.0,1366450.0,17919915.0,51498459.0,0100888833
1,17,20190430,25353086.0,56696861.0,82049947.0,20401851.0,11050832.0,31452683.0,1366450.0,17183344.0,50597264.0,0100888833
2,18,20200424,16744383.0,55112776.0,71857159.0,14425198.0,7569035.0,21994233.0,1692086.0,10919476.0,49862926.0,0100888833
3,3,20180430,39187249.0,27230058.0,66417307.0,11385513.0,0.0,11385513.0,4966967.0,-13005260.0,55031794.0,0101038103
4,4,20190329,48327659.0,27131019.0,75458678.0,18400027.0,5741445.0,24141472.0,4966967.0,-16719848.0,51317206.0,0101038103

In [72]:
df3.to_excel('재무상태표_v4.xlsx', encoding='euc-kr')

In [80]:
corp.isnull().sum()

Unnamed: 0              0
corp_code               0
corp_name               0
corp_name_eng        1575
jurir_no             1757
bizr_no               862
adres                   3
hm_url              53933
country_code            0
phn_no                171
country_code_fax        0
fax_no              13895
induty_code           249
est_dt                311
acc_mt                 79
dtype: int64

In [75]:
df3.isnull().sum()

회차               0
등록일              0
유동자산            72
비유동자산           83
자산총계            19
유동부채            75
비유동부채          132
부채총계            14
자본금            182
이익잉여금(결손금)    1679
자본총계            56
bizr_no          0
dtype: int64

In [83]:
# 기업개황에서 사업자등록번호가 null인 행 삭제
corp2 = corp.dropna(subset=['bizr_no'])

In [84]:
corp2.isnull().sum()

Unnamed: 0              0
corp_code               0
corp_name               0
corp_name_eng        1523
jurir_no             1635
bizr_no                 0
adres                   1
hm_url              53192
country_code            0
phn_no                160
country_code_fax        0
fax_no              13586
induty_code           210
est_dt                255
acc_mt                 70
dtype: int64

In [85]:
len(corp2)

80077

In [86]:
corp2.to_excel('기업개황_v4.xlsx', encoding='euc-kr')

## 대표자

In [140]:
ceos = pd.read_excel('/Users/linakim/Desktop/최종프로젝트/데이터_가공/대표자/대표자_v4.xlsx',
                    dtype={'corp_code':str})

In [141]:
ceos.isnull().sum()

Unnamed: 0     0
corp_code      0
ceo_nm        18
dtype: int64

In [142]:
type(ceos['corp_code'].iloc[0])

str

In [128]:
type(ceos['corp_code'].iloc[0])

str

In [124]:
type(corp['corp_code'].iloc[0])

str

In [143]:
ceos = pd.merge(corp, ceos, how='outer', on='corp_code')

In [144]:
ceos = ceos.drop(['Unnamed: 0_x', 'Unnamed: 0_y', 'corp_name', 'adres', 'hm_url', 
              'country_code', 'phn_no', 'fax_no', 'country_code_fax', 'induty_code', 'est_dt', 
              'acc_mt', 'corp_name_eng', 'jurir_no', 'corp_code'], axis=1)

In [136]:
ceos.head()

      bizr_no ceo_nm
0  3128134722    김상규
1  2248105027    이광선
2  1048177488    정진형
3  6168120149    정우석
4  1078608501    배경오

In [145]:
len(ceos)

84797

In [146]:
ceos.isnull().sum()

bizr_no    901
ceo_nm      19
dtype: int64

In [150]:
# 대표자에서 사업자등록번호가 null인 행 삭제
ceos2 = ceos.dropna()

In [151]:
ceos2.isnull().sum()

bizr_no    0
ceo_nm     0
dtype: int64

In [152]:
len(ceos2)

83880

In [153]:
ceos2.to_excel('대표자_v5.xlsx', encoding='euc-kr')